# Proceso ETL de datos de ***"Accidentes en Londres 2015-2018"***

## Importación de *librerías base*:

In [30]:
import pandas as pd
from sqlalchemy import create_engine

## Proceso de ***extracción***:

### 1. Extracción de la información desde el **archivo CSV** y guardarlo en una variable como DataFrame

In [31]:
df = pd.read_excel('src/accidents.xlsx')

### 2. Ver los primeros 5 registros del DataFrame:

In [6]:
df.head()

,Year,Date Of Incident,Route,Operator,Group Name,Bus Garage,Borough,Injury Result Description,Incident Event Type,Victim Category,Victims Sex,Victims Age
0,2015,2015-01-01,1,London General,Go-Ahead,Garage Not Available,Southwark,Injuries treated on scene,Onboard Injuries,Passenger,Male,Child
1,2015,2015-01-01,4,Metroline,Metroline,Garage Not Available,Islington,Injuries treated on scene,Onboard Injuries,Passenger,Male,Unknown
2,2015,2015-01-01,5,East London,Stagecoach,Garage Not Available,Havering,Taken to Hospital – Reported Serious Injury or...,Onboard Injuries,Passenger,Male,Elderly
3,2015,2015-01-01,5,East London,Stagecoach,Garage Not Available,None London Borough,Taken to Hospital – Reported Serious Injury or...,Onboard Injuries,Passenger,Male,Elderly
4,2015,2015-01-01,6,Metroline,Metroline,Garage Not Available,Westminster,Reported Minor Injury - Treated at Hospital,Onboard Injuries,Pedestrian,Female,Elderly

## Proceso de ***transformación***:

### 1. Obtener una descripción estadística los columnas que contengan datos numéricos

In [32]:
df.describe()

               Year
count  23158.000000
mean    2016.449607
std        1.074073
min     2015.000000
25%     2016.000000
50%     2016.000000
75%     2017.000000
max     2018.000000

### 2. Obtener información sobre las columnas y tipos de datos:

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23158 entries, 0 to 23157
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       23158 non-null  int64
 1   Date Of Incident           23158 non-null  datetime64[ns]
 2   Route                      23158 non-null  object
 3   Operator                   23158 non-null  object
 4   Group Name                 23158 non-null  object
 5   Bus Garage                 23158 non-null  object
 6   Borough                    23158 non-null  object
 7   Injury Result Description  23158 non-null  object
 8   Incident Event Type        23158 non-null  object
 9   Victim Category            23158 non-null  object
 10  Victims Sex                23158 non-null  object
 11  Victims Age                23158 non-null  object
dtypes: datetime64[ns](1), int64(1), object(10)
memory usage: 2.1+ MB

### 3. Revisión de registros nulos o vacios:

In [33]:
df.isnull().sum()

Year                         0
Date Of Incident             0
Route                        0
Operator                     0
Group Name                   0
Bus Garage                   0
Borough                      0
Injury Result Description    0
Incident Event Type          0
Victim Category              0
Victims Sex                  0
Victims Age                  0
dtype: int64

In [35]:
# Verificar si hay filas vacías o en blanco
empty_rows = df.isnull().any(axis=1) | (df == '').any(axis=1)
empty_rows

0        False
1        False
2        False
3        False
4        False
         ...
23153    False
23154    False
23155    False
23156    False
23157    False
Length: 23158, dtype: bool

#### 4. Análisis del DataFrame:

La intención de este proceso ETL de este archivo es generar un *Esquema Estrella* y almacenarlo en una Base de Datos.
- Un **esquema *"Estrella"*** un modelo de datos que contiene una tabla de hechos para almacenar datos medidos y transaccionales.
- También utiliza diferentes tablas dimensionales más pequeñas que contienen atributos que referencian a la tabla principal.

![image](src/img.png)

Por ello al analizar las columnas la tabla principal se llamará ***"accidents"*** con las siguientes columnas:
- *id_accident*
- *date_of_incident*
- *id_route*
- *id_operator*
- *id_group_name*
- *id_bus_garage*
- *id_borough*
- *id_injury_result_description*
- *id_incident_event*
- *id_victim_category*
- *id_victims_sex*
- *id_victims_age*

Y a partir de la tabla central se crearán las siguientes tablas dimensión que referenciarán a cada ID colocado:
Tabla **"routes"**:
- *id_route*
- *route_name*

Tabla **"operator"**:
- *id_operator*
- *operator_name*

Tabla **"group_name"**:
- *id_group_name*
- *group_name_name*

Tabla **"bus_garage"**:
- *id_bus_garage*
- *bus_garage_name*

Tabla **"borough"**:
- *id_borough*
- *borough_name*

Tabla **"injury_result_description"**:
- *id_injury_result_description*
- *injury_result_description_name*

Tabla **"incident_event"**:
- *id_incident_event*
- *incident_event_name*

Tabla **"victim_category"**:
- *id_victim_category*
- *victim_category_name*

Tabla **"victims_sex"**:
- *id_victims_sex*
- *victims_sex_name*

Tabla **"victims_age"**:
- *id_victims_age*
- *victims_age_name*

Es por eso que el primer paso de la transformación es crear DataFrames para dimensión mencionada anteriormente:

### 5. Crear dimensiones:

In [36]:
def create_dimension(data, id_name,column_name): # creación de la función recibiendo dos parámetros
    list_keys = [] # creación de una variable que recibe una lista de llaves
    value = 1 # variable de inicio para aplicar las iteraciones

    for _ in data: # recorrerá todos los elementos que se pasen del parámetro recibido
        list_keys.append(value) # guardará todos los valores del contador en la lista
        value += 1 # sumar al contador
    '''
        por último retornará un Dataframe con dos columnas, el id_name con la lista de llaves
        y values para el dato recibido como parámetro
    '''
    return pd.DataFrame({id_name: list_keys, column_name: data})

#### 5.1 Dimensión "**route**":

In [37]:
df_route = create_dimension(df['Route'].unique(), 'id_route', 'route_name')
df_route

     id_route route_name
0           1          1
1           2          4
2           3          5
3           4          6
4           5          8
..        ...        ...
607       608        W12
608       609       N113
609       610        398
610       611       N453
611       612    (blank)

[612 rows x 2 columns]

#### 5.2 Dimensión "**operator**":

In [38]:
df_operator = create_dimension(df['Operator'].unique(), 'id_operator', 'operator_name')
df_operator

    id_operator          operator_name
0             1         London General
1             2              Metroline
2             3            East London
3             4                Selkent
4             5          London United
5             6         London Central
6             7         Metroline West
7             8          Tower Transit
8             9    Arriva London North
9            10         Abellio London
10           11               Metrobus
11           12    Arriva London South
12           13      Arriva The Shires
13           14  Arriva Kent Thameside
14           15           Abellio West
15           16        Docklands Buses
16           17    Blue Triangle Buses
17           18           H R Richmond
18           19               C T Plus
19           20       London Sovereign
20           21              TGM GROUP
21           22         Sullivan Buses
22           23              Uno Buses
23           24           Quality Line
24           25   Sullivan Bus & Coach

#### 5.3 Dimensión "**group_name**":

In [39]:
df_group_name = create_dimension(df['Group Name'].unique(), 'id_group_name', 'group_name')
df_group_name

    id_group_name             group_name
0               1               Go-Ahead
1               2              Metroline
2               3             Stagecoach
3               4          London United
4               5          Tower Transit
5               6          Arriva London
6               7                Abellio
7               8      Arriva The Shires
8               9  Arriva Kent Thameside
9              10           Quality Line
10             11                CT Plus
11             12                    TGM
12             13         Sullivan Buses
13             14              Uno Buses

#### 5.4 Dimensión "**bus_garage**":

In [40]:
df_bus_garage = create_dimension(df['Bus Garage'].unique(), 'id_bus_garage', 'bus_garage_name')
df_bus_garage

    id_bus_garage               bus_garage_name
0               1          Garage Not Available
1               2  Mandela Way (London General)
2               3                       Norwood
3               4    Battersea (Abellio London)
4               5                      Holloway
..            ...                           ...
79             80                      Hatfield
80             81            Walthamstow Avenue
81             82                      Southall
82             83             Morden Wharf Road
83             84           Kangley Bridge Road

[84 rows x 2 columns]

#### 5.5 Dimensión "**borough**":

In [41]:
df_borough = create_dimension(df['Borough'].unique(), 'id_borough', 'borough_name')
df_borough

    id_borough          borough_name
0            1             Southwark
1            2             Islington
2            3              Havering
3            4   None London Borough
4            5           Westminster
5            6        City of London
6            7  Hammersmith & Fulham
7            8  Kensington & Chelsea
8            9                 Brent
9           10                Camden
10          11              Hounslow
11          12  Richmond Upon Thames
12          13               Enfield
13          14        Waltham Forest
14          15            Wandsworth
15          16               Hackney
16          17                Barnet
17          18               Lambeth
18          19              Lewisham
19          20               Croydon
20          21                Bexley
21          22  Kingston upon Thames
22          23                Merton
23          24               Bromley
24          25              Haringey
25          26                Ealing
26          27            Hillingdon
27          28                Newham
28          29                Harrow
29          30                Sutton
30          31             Greenwich
31          32             Redbridge
32          33         Tower Hamlets
33          34    Barking & Dagenham
34          35         Not specified

#### 5.6 Dimensión "**injury_result_description**":

In [42]:
df_injury_result_description = create_dimension(df['Injury Result Description'].unique(), 'id_injury_result_description', 'injury_result_description_name')
df_injury_result_description

,id_injury_result_description,injury_result_description_name
0,1,Injuries treated on scene
1,2,Taken to Hospital – Reported Serious Injury or...
2,3,Reported Minor Injury - Treated at Hospital
3,4,Fatal

#### 5.7 Dimensión "**incident_event_type**":

In [43]:
df_incident_event_type = create_dimension(df['Incident Event Type'].unique(), 'id_incident_event', 'incident_event_type_name')
df_incident_event_type

   id_incident_event incident_event_type_name
0                  1         Onboard Injuries
1                  2       Collision Incident
2                  3                  Assault
3                  4    Vandalism Hooliganism
4                  5  Safety Critical Failure
5                  6          Personal Injury
6                  7           Slip Trip Fall
7                  8  Activity Incident Event
8                  9                     Fire
9                 10                  Robbery

#### 5.8 Dimensión "**victim_category**":

In [44]:
df_victim_category = create_dimension(df['Victim Category'].unique(), 'id_victim_category', 'victim_category_name')
df_victim_category

    id_victim_category         victim_category_name
0                    1                    Passenger
1                    2                   Pedestrian
2                    3                    Conductor
3                    4                   Bus Driver
4                    5             Member Of Public
5                    6                      Cyclist
6                    7                 Motorcyclist
7                    8  3rd Party driver / Occupant
8                    9                        Other
9                   10        Non-Operational Staff
10                  11            Operational Staff
11                  12             Contractor Staff
12                  13                    TfL Staff
13                  14     Operations staff (other)
14                  15                     Cyclist
15                  16                Motorcyclist
16                  17            Insufficient Data

#### 5.9 Dimensión "**victims_sex**":

In [45]:
df_victims_sex = create_dimension(df['Victims Sex'].unique(), 'id_victims_sex', 'victims_sex_name')
df_victims_sex

   id_victims_sex victims_sex_name
0               1             Male
1               2           Female
2               3          Unknown

#### 5.10 Dimensión "**victims_age**":

In [46]:
df_victims_age = create_dimension(df['Victims Age'].unique(), 'id_victims_age', 'victims_age_name')
df_victims_age

   id_victims_age victims_age_name
0               1            Child
1               2          Unknown
2               3          Elderly
3               4            Adult
4               5            Youth

### 6. Unión de los ID's:

Mediante cada nombre (registro) de cada ***dimensión*** se asociará (***UNIÓN***) el ***ID*** que le corresponde para almacenarlo en el DataFrame principal

In [47]:
merged_df  = df.merge(df_route, left_on='Route', right_on='route_name', how='left')
merged_df = merged_df.merge(df_operator, left_on='Operator', right_on='operator_name', how='left')
merged_df = merged_df.merge(df_group_name, left_on='Group Name', right_on='group_name', how='left')
merged_df = merged_df.merge(df_bus_garage, left_on='Bus Garage', right_on='bus_garage_name', how='left')
merged_df = merged_df.merge(df_borough, left_on='Borough', right_on='borough_name', how='left')
merged_df = merged_df.merge(df_injury_result_description, left_on='Injury Result Description', right_on='injury_result_description_name', how='left')
merged_df = merged_df.merge(df_incident_event_type, left_on='Incident Event Type', right_on='incident_event_type_name', how='left')
merged_df = merged_df.merge(df_victim_category, left_on='Victim Category',  right_on='victim_category_name', how='left')
merged_df = merged_df.merge(df_victims_sex, left_on='Victims Sex', right_on='victims_sex_name', how='left')
merged_df = merged_df.merge(df_victims_age, left_on='Victims Age', right_on='victims_age_name', how='left')
merged_df

,Year,Date Of Incident,Route,Operator,Group Name,Bus Garage,Borough,Injury Result Description,Incident Event Type,Victim Category,...,id_injury_result_description,injury_result_description_name,id_incident_event,incident_event_type_name,id_victim_category,victim_category_name,id_victims_sex,victims_sex_name,id_victims_age,victims_age_name
0,2015,2015-01-01,1,London General,Go-Ahead,Garage Not Available,Southwark,Injuries treated on scene,Onboard Injuries,Passenger,...,1,Injuries treated on scene,1,Onboard Injuries,1,Passenger,1,Male,1,Child
1,2015,2015-01-01,4,Metroline,Metroline,Garage Not Available,Islington,Injuries treated on scene,Onboard Injuries,Passenger,...,1,Injuries treated on scene,1,Onboard Injuries,1,Passenger,1,Male,2,Unknown
2,2015,2015-01-01,5,East London,Stagecoach,Garage Not Available,Havering,Taken to Hospital – Reported Serious Injury or...,Onboard Injuries,Passenger,...,2,Taken to Hospital – Reported Serious Injury or...,1,Onboard Injuries,1,Passenger,1,Male,3,Elderly
3,2015,2015-01-01,5,East London,Stagecoach,Garage Not Available,None London Borough,Taken to Hospital – Reported Serious Injury or...,Onboard Injuries,Passenger,...,2,Taken to Hospital – Reported Serious Injury or...,1,Onboard Injuries,1,Passenger,1,Male,3,Elderly
4,2015,2015-01-01,6,Metroline,Metroline,Garage Not Available,Westminster,Reported Minor Injury - Treated at Hospital,Onboard Injuries,Pedestrian,...,3,Reported Minor Injury - Treated at Hospital,1,Onboard Injuries,2,Pedestrian,2,Female,3,Elderly
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23153,2018,2018-09-01,(blank),East London,Stagecoach,West Ham,Newham,Injuries treated on scene,Personal Injury,Bus Driver,...,1,Injuries treated on scene,6,Personal Injury,4,Bus Driver,1,Male,4,Adult
23154,2018,2018-09-01,(blank),London United,London United,Hounslow,Not specified,Injuries treated on scene,Personal Injury,Bus Driver,...,1,Injuries treated on scene,6,Personal Injury,4,Bus Driver,1,Male,4,Adult
23155,2018,2018-09-01,(blank),London United,London United,Park Royal,Harrow,Injuries treated on scene,Slip Trip Fall,Operational Staff,...,1,Injuries treated on scene,7,Slip Trip Fall,11,Operational Staff,1,Male,4,Adult
23156,2018,2018-09-01,(blank),London United,London United,Shepherds Bush,Hammersmith & Fulham,Injuries treated on scene,Personal Injury,Bus Driver,...,1,Injuries treated on scene,6,Personal Injury,4,Bus Driver,1,Male,4,Adult
23157,2018,2018-09-01,(blank),Metroline,Metroline,Holloway,Islington,Injuries treated on scene,Personal Injury,Other,...,1,Injuries treated on scene,6,Personal Injury,9,Other,3,Unknown,2,Unknown

### 7. Limpieza el DataFrame principal.

Las únicas columnas que se deben mantener son la ***fecha del incidente*** y los ***ID's*** de cada ***dimensión***.

In [48]:
df_accidents_final = merged_df[["Date Of Incident", "id_route", "id_operator", "id_group_name", "id_bus_garage", "id_borough",
                                            "id_injury_result_description", "id_incident_event",
                                            "id_victim_category", "id_victims_sex", "id_victims_age"]]
df_accidents_final

,Date Of Incident,id_route,id_operator,id_group_name,id_bus_garage,id_borough,id_injury_result_description,id_incident_event,id_victim_category,id_victims_sex,id_victims_age
0,2015-01-01,1,1,1,1,1,1,1,1,1,1
1,2015-01-01,2,2,2,1,2,1,1,1,1,2
2,2015-01-01,3,3,3,1,3,2,1,1,1,3
3,2015-01-01,3,3,3,1,4,2,1,1,1,3
4,2015-01-01,4,2,2,1,5,3,1,2,2,3
...,...,...,...,...,...,...,...,...,...,...,...
23153,2018-09-01,612,3,3,57,28,1,6,4,1,4
23154,2018-09-01,612,5,4,35,35,1,6,4,1,4
23155,2018-09-01,612,5,4,65,29,1,7,11,1,4
23156,2018-09-01,612,5,4,41,7,1,6,4,1,4
23157,2018-09-01,612,2,2,5,2,1,6,9,3,2

#### 7.1 Agregación de un ID único y renombramiento de una columna.

In [49]:
df_accidents_final['id_accident'] = df_accidents_final.index + 1
df_accidents_final = df_accidents_final.rename(columns={'Date Of Incident': 'date_of_incident'})
df_accidents_final

C:\Users\luis_\AppData\Local\Temp\ipykernel_16740\3587882890.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_accidents_final['id_accident'] = df_accidents_final.index + 1

,date_of_incident,id_route,id_operator,id_group_name,id_bus_garage,id_borough,id_injury_result_description,id_incident_event,id_victim_category,id_victims_sex,id_victims_age,id_accident
0,2015-01-01,1,1,1,1,1,1,1,1,1,1,1
1,2015-01-01,2,2,2,1,2,1,1,1,1,2,2
2,2015-01-01,3,3,3,1,3,2,1,1,1,3,3
3,2015-01-01,3,3,3,1,4,2,1,1,1,3,4
4,2015-01-01,4,2,2,1,5,3,1,2,2,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...
23153,2018-09-01,612,3,3,57,28,1,6,4,1,4,23154
23154,2018-09-01,612,5,4,35,35,1,6,4,1,4,23155
23155,2018-09-01,612,5,4,65,29,1,7,11,1,4,23156
23156,2018-09-01,612,5,4,41,7,1,6,4,1,4,23157
23157,2018-09-01,612,2,2,5,2,1,6,9,3,2,23158

#### 7.2 Reubicación de las columnas.

In [50]:
df_accidents_final = df_accidents_final[['id_accident', 'date_of_incident', 'id_route', "id_operator", "id_group_name", "id_bus_garage", "id_borough", 'id_injury_result_description', 'id_incident_event', 'id_victim_category', 'id_victims_sex', 'id_victims_age']]
df_accidents_final

,id_accident,date_of_incident,id_route,id_operator,id_group_name,id_bus_garage,id_borough,id_injury_result_description,id_incident_event,id_victim_category,id_victims_sex,id_victims_age
0,1,2015-01-01,1,1,1,1,1,1,1,1,1,1
1,2,2015-01-01,2,2,2,1,2,1,1,1,1,2
2,3,2015-01-01,3,3,3,1,3,2,1,1,1,3
3,4,2015-01-01,3,3,3,1,4,2,1,1,1,3
4,5,2015-01-01,4,2,2,1,5,3,1,2,2,3
...,...,...,...,...,...,...,...,...,...,...,...,...
23153,23154,2018-09-01,612,3,3,57,28,1,6,4,1,4
23154,23155,2018-09-01,612,5,4,35,35,1,6,4,1,4
23155,23156,2018-09-01,612,5,4,65,29,1,7,11,1,4
23156,23157,2018-09-01,612,5,4,41,7,1,6,4,1,4
23157,23158,2018-09-01,612,2,2,5,2,1,6,9,3,2

## Proceso de ***carga***:

### 1. Exportar DataFrames.

In [51]:
df_operator.to_csv('target/operator.csv', index=False, sep='|')
df_group_name.to_csv('target/group_name.csv', index=False, sep='|')
df_bus_garage.to_csv('target/bus_garage.csv', index=False, sep='|')
df_borough.to_csv('target/borough.csv', index=False, sep='|')
df_injury_result_description.to_csv('target/injury_result_description.csv', index=False, sep='|')
df_incident_event_type.to_csv('target/incident_event_type.csv', index=False, sep='|')
df_victim_category.to_csv('target/victim_category.csv', index=False, sep='|')
df_victims_sex.to_csv('target/victims_sex.csv', index=False, sep='|')
df_victims_age.to_csv('target/victims_age.csv', index=False, sep='|')

df_route.to_csv('target/routes.csv', index=False, sep='|')
df_accidents_final.to_csv('target/accidents.csv', index=False, sep='|')

### 2. Elaboración de la Base de Datos

Una vez obtenidos los datos se requiere calcular el número de caracteres que tendrá cada tabla de dimensión:

In [52]:
for i in df:
    max_length = max(df[i], key=lambda x: len(str(x)))
    print('Dato registro:',max_length, 'Longitud:', len(str(max_length)))

Dato registro: 2015 Longitud: 4
Dato registro: 2015-01-01 00:00:00 Longitud: 19
Dato registro: (blank) Longitud: 7
Dato registro: Arriva Kent Thameside Longitud: 21
Dato registro: Arriva Kent Thameside Longitud: 21
Dato registro: Twickenham (Abellio London W) Longitud: 29
Dato registro: Hammersmith & Fulham Longitud: 20
Dato registro: Taken to Hospital – Reported Serious Injury or Severity Unknown Longitud: 63
Dato registro: Safety Critical Failure Longitud: 23
Dato registro: 3rd Party driver / Occupant Longitud: 27
Dato registro: Unknown Longitud: 7
Dato registro: Unknown Longitud: 7

En base a ello se crea el siguiente script para el SGBD PostgreSQL:

```sql
DROP TABLE  IF EXISTS routes;
CREATE  TABLE IF NOT EXISTS routes(
    id_route INTEGER,
    route_name VARCHAR(10)
);


DROP TABLE IF EXISTS operator;
CREATE TABLE IF NOT EXISTS operator(
    id_operator INTEGER,
    operator_name VARCHAR(30)
);


DROP TABLE IF EXISTS group_name;
CREATE TABLE IF NOT EXISTS group_name (
    id_group_name INTEGER,
    group_name VARCHAR(30)
);


DROP TABLE IF EXISTS bus_garage;
CREATE TABLE IF NOT EXISTS bus_garage(
    id_bus_garage INTEGER,
    bus_garage_name VARCHAR(40)
);


DROP TABLE IF EXISTS borough;
CREATE TABLE IF NOT EXISTS borough(
    id_borough INTEGER,
    borough_name VARCHAR(40)
);


DROP TABLE IF EXISTS injury_result_description;
CREATE TABLE IF NOT EXISTS injury_result_description(
    id_injury_result_description INTEGER,
    injury_result_description_name VARCHAR(80)
);


DROP TABLE IF EXISTS incident_event_type;
CREATE TABLE IF NOT EXISTS incident_event_type(
    id_incident_event INTEGER,
    incident_event_name VARCHAR(30)
);


DROP TABLE IF EXISTS victim_category;
CREATE TABLE IF NOT EXISTS victim_category(
    id_type_victim INTEGER,
    type_victim_name VARCHAR(40)
);

DROP TABLE IF EXISTS victims_sex;
CREATE TABLE IF NOT EXISTS victims_sex(
    id_victims_sex INTEGER,
    victims_sex_name VARCHAR(20)
);


DROP TABLE IF EXISTS victims_age;
CREATE TABLE IF NOT EXISTS victims_age (
    id_victims_age INTEGER,
    victims_age_name VARCHAR(20)
);

DROP TABLE IF EXISTS accidents;
CREATE TABLE IF NOT EXISTS accidents(
    id_accident INTEGER,
    date_of_incident DATE,
    id_route INTEGER,
    id_operator INTEGER,
    id_group_name INTEGER,
    id_bus_garage INTEGER,
    id_borough INTEGER,
    id_injury_result_description INTEGER,
    id_incident_event INTEGER,
    id_victim_category INTEGER,
    id_victims_sex INTEGER,
    id_victims_age INTEGER
);
```

### 3. Exportar los datos a PostgreSQL

Una vez creado se crea una función que a partir de los archivos CSV exportados se crea la conexión con la Base de Datos y se exporta mediante la función ***to_sql***:

In [53]:
def import_csv_to_postgresql(csv_file):

    # Crear una conexión a la base de datos MySQL
    engine = create_engine('postgresql+psycopg2://postgres:12345678@localhost:5432/accidents')
    connection= engine.connect()


    df = pd.read_csv('target/'+csv_file+'.csv', delimiter='|')
    try:
        # Insertar los datos del DataFrame en la tabla de PostgreSQL
        df.to_sql(csv_file, engine, if_exists='replace', index=False)
        print("Se insertaron correctamente los datos del archivo "+csv_file)
    except Exception as e:
        print("No se insertaron los datos del archivo "+csv_file)
        print(e)
    # Cerrar la conexión
    connection.close()

In [54]:
import_csv_to_postgresql('operator')
import_csv_to_postgresql('group_name')
import_csv_to_postgresql('bus_garage')
import_csv_to_postgresql('borough')
import_csv_to_postgresql('injury_result_description')
import_csv_to_postgresql('incident_event_type')
import_csv_to_postgresql('victim_category')
import_csv_to_postgresql('victims_sex')
import_csv_to_postgresql('victims_age')

import_csv_to_postgresql('routes')
import_csv_to_postgresql('accidents')

Se insertaron correctamente los datos del archivo operator
Se insertaron correctamente los datos del archivo group_name
Se insertaron correctamente los datos del archivo bus_garage
Se insertaron correctamente los datos del archivo borough
Se insertaron correctamente los datos del archivo injury_result_description
Se insertaron correctamente los datos del archivo incident_event_type
Se insertaron correctamente los datos del archivo victim_category
Se insertaron correctamente los datos del archivo victims_sex
Se insertaron correctamente los datos del archivo victims_age
Se insertaron correctamente los datos del archivo routes
Se insertaron correctamente los datos del archivo accidents